In [1]:
import pandas as pd 
import numpy as np 
import seaborn as sns

In [2]:
pd.DataFrame({'type':['A', 'A', 'B', 'B'], 'value':[10,14,12,23]})

  type  value
0    A     10
1    A     14
2    B     12
3    B     23

In [3]:
my_stat = pd.read_csv('my_stat.csv')
my_stat[:20]

    V1    V2 V3   V4
0    2  13.0  B  1.0
1   -1   7.0  B  1.0
2    0  11.0  A  0.0
3    2  11.0  A  2.0
4    0  10.0  B -1.0
5    2  11.0  A  0.0
6    0   9.0  A  2.0
7    1   9.0  A  1.0
8    0   9.0  B  2.0
9   -1  10.0  A  0.0
10   1  10.0  A  1.0
11  -2  10.0  A  1.0
12   0   8.0  B  0.0
13   1  12.0  A  3.0
14  -1  10.0  A  2.0
15   2  10.0  B  1.0
16   0   9.0  B  1.0
17   0  11.0  A  0.0
18   0   8.0  A  1.0
19   0  10.0  A  1.0

In [4]:
subset_1 = my_stat.iloc[[i for i in range(10)],[0,2]]
subset_1

   V1 V3
0   2  B
1  -1  B
2   0  A
3   2  A
4   0  B
5   2  A
6   0  A
7   1  A
8   0  B
9  -1  A

In [5]:
subset_2 = my_stat.iloc[:,[1,3]].drop(my_stat.index[[0,4]])
subset_2

       V2   V4
1     7.0  1.0
2    11.0  0.0
3    11.0  2.0
5    11.0  0.0
6     9.0  2.0
..    ...  ...
495   8.0 -1.0
496   8.0  1.0
497  11.0  2.0
498  11.0  2.0
499   8.0  1.0

[498 rows x 2 columns]

In [6]:
subset_1.query("(V1 > 0) & (V3 == 'A')")

   V1 V3
3   2  A
5   2  A
7   1  A

In [7]:
subset_2.query("(V2 != 10) | (V4 >= 1)")

       V2   V4
1     7.0  1.0
2    11.0  0.0
3    11.0  2.0
5    11.0  0.0
6     9.0  2.0
..    ...  ...
495   8.0 -1.0
496   8.0  1.0
497  11.0  2.0
498  11.0  2.0
499   8.0  1.0

[446 rows x 2 columns]

In [8]:
import numpy as np

In [9]:
my_stat['V5'] = my_stat.V1 + my_stat.V4
my_stat

     V1    V2 V3   V4   V5
0     2  13.0  B  1.0  3.0
1    -1   7.0  B  1.0  0.0
2     0  11.0  A  0.0  0.0
3     2  11.0  A  2.0  4.0
4     0  10.0  B -1.0 -1.0
..   ..   ... ..  ...  ...
495   1   8.0  A -1.0  0.0
496   3   8.0  A  1.0  4.0
497  -1  11.0  B  2.0  1.0
498   1  11.0  A  2.0  3.0
499   0   8.0  B  1.0  1.0

[500 rows x 5 columns]

In [10]:
my_stat['V6'] = np.log(my_stat.V2)
my_stat

     V1    V2 V3   V4   V5        V6
0     2  13.0  B  1.0  3.0  2.564949
1    -1   7.0  B  1.0  0.0  1.945910
2     0  11.0  A  0.0  0.0  2.397895
3     2  11.0  A  2.0  4.0  2.397895
4     0  10.0  B -1.0 -1.0  2.302585
..   ..   ... ..  ...  ...       ...
495   1   8.0  A -1.0  0.0  2.079442
496   3   8.0  A  1.0  4.0  2.079442
497  -1  11.0  B  2.0  1.0  2.397895
498   1  11.0  A  2.0  3.0  2.397895
499   0   8.0  B  1.0  1.0  2.079442

[500 rows x 6 columns]

In [11]:
my_stat.rename(columns = {'V1':'session_value',
                'V2':'group',
                'V3':'time',
                'V4':'n_users'})

     session_value  group time  n_users   V5        V6
0                2   13.0    B      1.0  3.0  2.564949
1               -1    7.0    B      1.0  0.0  1.945910
2                0   11.0    A      0.0  0.0  2.397895
3                2   11.0    A      2.0  4.0  2.397895
4                0   10.0    B     -1.0 -1.0  2.302585
..             ...    ...  ...      ...  ...       ...
495              1    8.0    A     -1.0  0.0  2.079442
496              3    8.0    A      1.0  4.0  2.079442
497             -1   11.0    B      2.0  1.0  2.397895
498              1   11.0    A      2.0  3.0  2.397895
499              0    8.0    B      1.0  1.0  2.079442

[500 rows x 6 columns]

In [12]:
my_stat_1 = pd.read_csv('my_stat_1.csv')
my_stat_1

   session_value  time group  n_users
0            0.0    12     B        9
1            NaN    11     A       -1
2            1.0     8     A        1
3            2.0     9     B        3
4            2.0    10     B        9
5            3.0     8     A        8
6            NaN    11     B        5
7            0.0     9     A        4
8            0.0     8     B      -11
9            0.0     9     A      -20

In [13]:
import math

In [14]:
M = my_stat_1[my_stat_1.n_users >= 0.0].n_users.median()
for i in range(len(my_stat_1)):
    if math.isnan(my_stat_1.session_value[i]):
          my_stat_1.session_value[i] = 0
    if my_stat_1.n_users[i] < 0:
        my_stat_1.n_users[i] = M
my_stat_1

<ipython-input-14-ee9bb025ed22>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  my_stat_1.session_value[i] = 0
<ipython-input-14-ee9bb025ed22>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  my_stat_1.n_users[i] = M

   session_value  time group  n_users
0            0.0    12     B        9
1            0.0    11     A        5
2            1.0     8     A        1
3            2.0     9     B        3
4            2.0    10     B        9
5            3.0     8     A        8
6            0.0    11     B        5
7            0.0     9     A        4
8            0.0     8     B        5
9            0.0     9     A        5

In [16]:
my_stat_1.groupby('group', as_index=False).aggregate({'session_value':'mean'}).rename(columns = {'session_value' : 'mean_session_value'})

  group  mean_session_value
0     A                 0.8
1     B                 0.8